#Напишите программу, на вход которой подаётся список чисел одной строкой. 
#Программа должна для каждого элемента этого списка вывести сумму двух его соседей. 
#Для элементов списка, являющихся крайними, одним из соседей считается элемент, 
#находящий на противоположном конце этого списка. 
#Например, если на вход подаётся список "1 3 5 6 10", 
#то на выход ожидается список "13 6 9 15 7" (без кавычек).
#Если на вход пришло только одно число, надо вывести его же.
#Вывод должен содержать одну строку с числами нового списка, разделёнными пробелом.

a = [int(i) for i in input().split()]
b = [int(i) for i in a]
for i in range (len(a)):
  if len(a) == 1:
    b = a
  else:
    if a[i] == a[0]:
      b[0] = a[1] + a[-1]
    elif a[i] == a[-1]:
      b[-1] = a[-2] + a[0]
    else:
      b[i]= a[i-1] + a[i+1]
for j in b:
  print (j, end=' ')
